#define _MY_MUNE_C

#include "my_mune.h"

#include <stdio.h>


void login_mune() {
    printf("\033c");

    printf("                          ------------------------------------------------------------------------------                   \n\n\n\n\n\n");
    printf("                                                    1.   登录                                                                    \n\n\n");
    printf("                                                    2.   注册                                                                    \n\n\n");
    printf("                                                    3.   找回密码                                                                \n\n\n");
    printf("                                                    4.   优雅退出                                                                \n\n\n");
    printf("                          ------------------------------------------------------------------------------                         \n\n\n");
    printf("请选择:\n");
}


void mune() {
    printf("\033c");
    printf("登陆成功!!!\n");

    printf("                           ---------------------------------------------------------------------------                       \n\n\n\n");
    printf("                                                    1.   修改密码                                                                \n");
    printf("                                                    2.   加好友                                                                  \n");
    printf("                                                    3.   删除好友                                                                \n");
    printf("                                                    4.   处理好友请求                                                            \n");
    printf("                                                    5.   拉黑好友                                                                \n");
    printf("                                                    6.   将好友从黑名单中取出                                                    \n");
    printf("                                                    7.   设置好友特别关心                                                        \n");
    printf("                                                    8.   取消好友特别关心                                                        \n");
    printf("                                                    9.   显示好友列表                                                            \n");
    printf("                                                    10.  私聊                                                                    \n");
    printf("                                                    11.  查看好友消息                                                            \n");
    printf("                                                    12.  群聊                                                                    \n");
    printf("                                                    13.  加群                                                                    \n");
    printf("                                                    14.  创建群聊                                                                \n");
    printf("                                                    15.  退出群                                                                  \n");
    printf("                                                    16.  设置管理员                                                              \n");
    printf("                                                    17.  删除管理员                                                              \n");
    printf("                                                    18.  查看群成员                                                              \n");
    printf("                                                    19.  传送文件                                                                \n");
    printf("                                                    20.  查看好友聊天记录                                                        \n");
    printf("                                                    21.  删除好友聊天记录                                                        \n");
    printf("                                                    22.  查看群消息                                                              \n");
    printf("                                                    23.  群t人                                                                   \n");
    printf("                                                    24.  查看已加入的群                                                          \n");
    printf("                                                    25.  接受文件                                                                \n");
    printf("                                                    26.  优雅退出                                                                \n");
    printf("                           --------------------------------------------------------------------------                               ");
}
